tylertms/kinetis-k22-sim/src/device/kinetis/device.c
bool kinetis_dma_read(Kinetis* device, uint32_t address, uint8_t access_size,
                      uint32_t* output_value) {
    if (device == NULL || output_value == NULL ||
        (access_size != 1u && access_size != 2u && access_size != 4u) ||
        !sysmpu_access_allowed(device, address, access_size, 2u, true, KINETIS_SYSMPU_READ))
        return false;
    return memory_read_unprotected(device, address, access_size, CORTEX_M4_ACCESS_DATA, 2u,
                                   output_value);
}

bool kinetis_dma_write(Kinetis* device, uint32_t address, uint8_t access_size,
                       uint32_t write_value) {
    if (device == NULL || (access_size != 1u && access_size != 2u && access_size != 4u) ||
        !sysmpu_access_allowed(device, address, access_size, 2u, true, KINETIS_SYSMPU_WRITE))
        return false;
    return memory_write_unprotected(device, address, access_size, CORTEX_M4_ACCESS_DATA, 2u,
                                    write_value);
}

bool kinetis_flash_controller_write(Kinetis* device, uint32_t address, uint8_t access_size,
                                    uint32_t write_value) {
    if (device == NULL || (access_size != 1u && access_size != 2u && access_size != 4u) ||
        !valid_memory_range(address, access_size, KINETIS_FLASH_BASE,
                            device->configuration.flash_size))
        return false;
    write_little_endian(device->flash + address, access_size, write_value);
    return true;
}

bool kinetis_flash_controller_read(Kinetis* device, uint32_t address, uint8_t access_size,
                                   uint32_t* output_value) {
    if (device == NULL || output_value == NULL ||
        (access_size != 1u && access_size != 2u && access_size != 4u) ||
        !valid_memory_range(address, access_size, KINETIS_FLASH_BASE,
                            device->configuration.flash_size))
        return false;
    *output_value = read_little_endian(device->flash + address, access_size);
    return true;
}

static const KinetisRegisterDescriptor* bit_band_descriptor(const Kinetis* device,
                                                            uint32_t register_byte_address) {
    for (size_t register_index = 0; register_index < device->manifest->register_count;
         register_index++) {
        const KinetisRegisterDescriptor* descriptor = &device->manifest->registers[register_index];
        const uint8_t register_size = (uint8_t)(descriptor->width / 8u);
        if (register_byte_address >= descriptor->address &&
            register_byte_address - descriptor->address < register_size) {
            return descriptor;
        }
    }
    return NULL;
}

static bool bit_band_read(Kinetis* device, uint32_t address, CortexM4Access access,
                          uint32_t* output_value) {
    if ((address & 3u) != 0) {
        return false;
    }
    const uint32_t alias_address = address - KINETIS_BIT_BAND_BASE;
    const uint32_t register_byte_address = KINETIS_PERIPHERAL_BASE + alias_address / 32u;
    const uint8_t bit_index = (uint8_t)((alias_address / 4u) & 7u);
    const KinetisRegisterDescriptor* descriptor =
        bit_band_descriptor(device, register_byte_address);
    if (descriptor == NULL || (descriptor->access & KINETIS_REGISTER_ACCESS_READ) == 0) {
        return false;
    }
    const uint8_t register_bit =
        (uint8_t)((register_byte_address - descriptor->address) * 8u + bit_index);
    const uint32_t bit_mask = 1u << register_bit;
    if ((descriptor->implemented_mask & descriptor->read_mask & bit_mask) == 0) {
        return false;
    }
    uint32_t register_value = 0u;
    if (!kinetis_peripheral_read(device, descriptor->address, (uint8_t)(descriptor->width / 8u),
                                 access, &register_value)) {
        return false;
    }
    *output_value = (register_value & bit_mask) != 0;
    return true;
}

static bool bit_band_write(Kinetis* device, uint32_t address, CortexM4Access access,
                           uint32_t write_value) {
    if ((address & 3u) != 0) {
        return false;
    }
    const uint32_t alias_address = address - KINETIS_BIT_BAND_BASE;
    const uint32_t register_byte_address = KINETIS_PERIPHERAL_BASE + alias_address / 32u;
    const uint8_t bit_index = (uint8_t)((alias_address / 4u) & 7u);
    const KinetisRegisterDescriptor* descriptor =
        bit_band_descriptor(device, register_byte_address);
    if (descriptor == NULL || (descriptor->access & KINETIS_REGISTER_ACCESS_WRITE) == 0) {
        return false;
    }
    const uint8_t register_bit =
        (uint8_t)((register_byte_address - descriptor->address) * 8u + bit_index);
    const uint32_t bit_mask = 1u << register_bit;
    if ((descriptor->implemented_mask & descriptor->write_mask & bit_mask) == 0) {
        return false;
    }
    uint32_t register_value = 0u;
    if (!kinetis_peripheral_read(device, descriptor->address, (uint8_t)(descriptor->width / 8u),
                                 access, &register_value)) {
        return false;
    }
    register_value &= ~descriptor->w1c_mask;
    if ((descriptor->w1c_mask & bit_mask) != 0) {
        if ((write_value & 1u) != 0) {
            register_value |= bit_mask;
        }
    } else {
        register_value =
            (write_value & 1u) != 0 ? register_value | bit_mask : register_value & ~bit_mask;
    }
    return kinetis_peripheral_write(device, descriptor->address, (uint8_t)(descriptor->width / 8u),
                                    access, register_value);
}

static bool bme_access(const Kinetis* device, uint32_t address, uint8_t access_size,
                       CortexM4Access access) {
    return device->profile->id == KINETIS_PROFILE_MKV10Z1287 && address >= 0x44000000u &&
           address < 0x60000000u && (access == CORTEX_M4_ACCESS_DATA ||
                                     access == CORTEX_M4_ACCESS_UNPRIVILEGED_DATA) &&
           (address & (access_size - 1u)) == 0u;
}

static uint32_t bme_peripheral_address(uint32_t address, bool bit_field) {
    uint32_t peripheral_address =
        address & (bit_field ? 0xe007ffffu : 0xe00fffffu);
    if (peripheral_address >= 0x4000f000u && peripheral_address < 0x4000f118u)
        peripheral_address += 0x000f0000u;
    return peripheral_address;
}

