tylertms/kinetis-k22-sim/src/device/kinetis/device.c
static uint32_t bme_field_mask(uint32_t address, uint8_t access_size) {
    const uint8_t container_bits = (uint8_t)(access_size * 8u);
    const uint8_t bit = (uint8_t)((address >> 23u) & (container_bits - 1u));
    uint8_t width = (uint8_t)(((address >> 19u) & 15u) + 1u);
    if (width > container_bits - bit)
        width = (uint8_t)(container_bits - bit);
    const uint32_t field = width == 32u ? UINT32_MAX : (1u << width) - 1u;
    return field << bit;
}

static bool bme_read(Kinetis* device, uint32_t address, uint8_t access_size,
                     CortexM4Access access, uint32_t* output_value) {
    const bool bit_field = (address & 0x10000000u) != 0u;
    const uint8_t operation = (uint8_t)((address >> 26u) & 7u);
    if (!bit_field && operation != 2u && operation != 3u)
        return false;
    const uint32_t peripheral_address = bme_peripheral_address(address, bit_field);
    uint32_t peripheral_value;
    if (!kinetis_peripheral_read(device, peripheral_address, access_size, access,
                                 &peripheral_value))
        return false;
    if (bit_field) {
        const uint8_t bit = (uint8_t)((address >> 23u) & (access_size * 8u - 1u));
        *output_value = (peripheral_value & bme_field_mask(address, access_size)) >> bit;
        return true;
    }
    const uint8_t bit = (uint8_t)((address >> 21u) & (access_size * 8u - 1u));
    const uint32_t mask = 1u << bit;
    *output_value = (peripheral_value & mask) != 0u;
    const uint32_t updated_value =
        operation == 2u ? peripheral_value & ~mask : peripheral_value | mask;
    return kinetis_peripheral_write(device, peripheral_address, access_size, access,
                                    updated_value);
}

static bool bme_write(Kinetis* device, uint32_t address, uint8_t access_size,
                      CortexM4Access access, uint32_t write_value) {
    const bool bit_field = (address & 0x10000000u) != 0u;
    const uint8_t operation = (uint8_t)((address >> 26u) & 7u);
    if (!bit_field && operation != 1u && operation != 2u && operation != 3u)
        return false;
    const uint32_t peripheral_address = bme_peripheral_address(address, bit_field);
    uint32_t peripheral_value;
    if (!kinetis_peripheral_read(device, peripheral_address, access_size, access,
                                 &peripheral_value))
        return false;
    uint32_t updated_value;
    if (bit_field) {
        const uint32_t mask = bme_field_mask(address, access_size);
        updated_value = (peripheral_value & ~mask) | (write_value & mask);
    } else if (operation == 1u) {
        updated_value = peripheral_value & write_value;
    } else if (operation == 2u) {
        updated_value = peripheral_value | write_value;
    } else {
        updated_value = peripheral_value ^ write_value;
    }
    return kinetis_peripheral_write(device, peripheral_address, access_size, access,
                                    updated_value);
}

static bool kinetis_read_bus(void* context, uint32_t address, uint8_t access_size,
                             CortexM4Access access, uint32_t* output_value) {
    Kinetis* device = context;
    if (bme_access(device, address, access_size, access))
        return bme_read(device, address, access_size, access, output_value);
    if (address >= KINETIS_BIT_BAND_BASE &&
        address < KINETIS_BIT_BAND_BASE + KINETIS_BIT_BAND_SIZE &&
        device->profile->cpu.architecture == KINETIS_CPU_ARCHITECTURE_ARMV7E_M) {
        if (access_size != 1u && access_size != 2u && access_size != 4u)
            return false;
        return bit_band_read(device, address, access, output_value);
    }
    return kinetis_memory_read(device, address, access_size, access, output_value);
}

static bool kinetis_write_bus(void* context, uint32_t address, uint8_t access_size,
                              CortexM4Access access, uint32_t write_value) {
    Kinetis* device = context;
    if (bme_access(device, address, access_size, access))
        return bme_write(device, address, access_size, access, write_value);
    if (address >= KINETIS_BIT_BAND_BASE &&
        address < KINETIS_BIT_BAND_BASE + KINETIS_BIT_BAND_SIZE &&
        device->profile->cpu.architecture == KINETIS_CPU_ARCHITECTURE_ARMV7E_M) {
        if (access_size != 1u && access_size != 2u && access_size != 4u)
            return false;
        return bit_band_write(device, address, access, write_value);
    }
    return kinetis_memory_write(device, address, access_size, access, write_value);
}

static void kinetis_advance_bus(void* context, uint32_t cycle_count) {
    Kinetis* device = context;
    device->cycles += cycle_count;
    kinetis_peripheral_advance(device, cycle_count);
}

static void kinetis_reset_bus(void* context) { kinetis_warm_reset(context, 0, 0x04u); }

static bool kinetis_core_clock_running(void* context) {
    Kinetis* device = context;
    kinetis_timing_set_cpu_sleeping(&device->timing, device->cpu->sleeping,
                                    (device->cpu->scr & 4u) != 0u);
    return !device->timing.reset_pin_held && device->timing.core_clock_hz != 0u;
}

KinetisConfiguration kinetis_configuration(KinetisProfile profile_id) {
    KinetisConfiguration configuration;
    const KinetisDeviceProfile* profile = kinetis_profile_get(profile_id);
    memset(&configuration, 0, sizeof(configuration));
    configuration.profile = profile_id;
    configuration.package = KINETIS_PACKAGE_DEFAULT;
    if (profile != NULL) {
        configuration.flash_size = profile->program_flash_size;
        configuration.sram_size = profile->sram_lower_size + profile->sram_upper_size;
    }
    configuration.external_oscillator_hz = 8000000u;
    configuration.rtc_oscillator_hz = 32768u;
    return configuration;
}

bool kinetis_profile_from_name(const char* name, KinetisProfile* profile) {
    const KinetisDeviceProfile* match = kinetis_profile_find(name);
    if (match == NULL || profile == NULL) {
        return false;
    }
    *profile = match->id;
    return true;
}

const char* kinetis_profile_name(KinetisProfile profile) {
    const KinetisDeviceProfile* match = kinetis_profile_get(profile);
    return match == NULL ? NULL : match->name;
}

