tylertms/kinetis-k22-sim/src/device/kinetis/device.c
bool kinetis_package_from_code(const char* code, KinetisPackage* package) {
    const KinetisPackageDescription* match = kinetis_package_find(code);
    if (match == NULL || package == NULL) {
        return false;
    }
    *package = (KinetisPackage)match->id;
    return true;
}

const char* kinetis_package_code(KinetisPackage package) {
    if (package == KINETIS_PACKAGE_DEFAULT) {
        return NULL;
    }
    const KinetisPackageDescription* match = kinetis_package_get((KinetisPackage)package);
    return match == NULL ? NULL : match->code;
}

static void destroy_partial_device(Kinetis* device) {
    if (device == NULL) {
        return;
    }
    cortex_m4_destroy(device->cpu);
    kinetis_data_destroy(device->data);
    kinetis_sdhc_destroy(&device->sdhc);
    free(device->flexbus_memory);
    free(device->flash);
    free(device->sram);
    free(device->sram_initialized);
    free(device->peripheral);
    free(device);
}

Kinetis* kinetis_create(KinetisConfiguration configuration) {
    const KinetisDeviceProfile* profile = kinetis_profile_get(configuration.profile);
    const KinetisRegisterManifest* manifest = kinetis_register_manifest_get(configuration.profile);
    if (profile == NULL || manifest == NULL) {
        return NULL;
    }
    const size_t profile_sram_size = (size_t)profile->sram_lower_size + profile->sram_upper_size;
    const KinetisPackageSelection* package_selection =
        configuration.package == KINETIS_PACKAGE_DEFAULT
            ? kinetis_package_default(profile)
            : kinetis_package_select(profile, (KinetisPackage)configuration.package);
    if (package_selection == NULL || configuration.flash_size == 0 ||
        configuration.flash_size > profile->program_flash_size || configuration.sram_size == 0 ||
        configuration.sram_size > profile_sram_size) {
        return NULL;
    }
    Kinetis* device = calloc(1, sizeof(*device));
    if (device == NULL) {
        return NULL;
    }
    device->configuration = configuration;
    device->first_uninitialized_sram_read = UINT32_MAX;
    device->profile = profile;
    device->package = package_selection;
    device->manifest = manifest;
    device->reset_pin_enabled = true;
    device->sram_base = configuration.sram_size == profile_sram_size
                            ? profile->sram_lower_address
                            : KINETIS_SRAM_CENTER - (uint32_t)(configuration.sram_size / 2u);
    device->flash = malloc(configuration.flash_size);
    device->sram = calloc(1, configuration.sram_size);
    device->sram_initialized = calloc(1, configuration.sram_size);
    device->peripheral = calloc(1, KINETIS_PERIPHERAL_SIZE);
    if (device->flash == NULL || device->sram == NULL || device->sram_initialized == NULL ||
        device->peripheral == NULL) {
        destroy_partial_device(device);
        return NULL;
    }
    memset(device->flash, 0xff, configuration.flash_size);
    if (!kinetis_serial_init(&device->serial, profile) ||
        !kinetis_sdhc_init(&device->sdhc, kinetis_sdhc_bus(device)) ||
        !kinetis_timing_init(&device->timing, profile, configuration.external_oscillator_hz,
                             configuration.rtc_oscillator_hz, kinetis_timing_signals(device)) ||
        !kinetis_io_init(&device->io, kinetis_io_configuration(device))) {
        destroy_partial_device(device);
        return NULL;
    }
    device->timing.sim_sdid_pin_id = kinetis_package_pin_id(package_selection);
    device->data = kinetis_data_create(profile, kinetis_data_bus(device));
    if (device->data == NULL) {
        destroy_partial_device(device);
        return NULL;
    }
    kinetis_sync_clock_gates(device);
    CortexM4Bus bus = {device, kinetis_read_bus, kinetis_write_bus, kinetis_advance_bus,
                       kinetis_reset_bus};
    device->cpu = cortex_m4_create(bus);
    if (device->cpu == NULL) {
        destroy_partial_device(device);
        return NULL;
    }
    cortex_m4_set_clock(device->cpu, kinetis_core_clock_running, device);
    cortex_m4_set_wait_states(device->cpu, kinetis_internal_wait_states, device);
    if (kinetis_profile_has_peripheral(profile, KINETIS_PERIPHERAL_MTB))
        cortex_m4_set_hardware_trace(device->cpu, kinetis_internal_mtb_trace, device);
    if (kinetis_profile_has_peripheral(profile, KINETIS_PERIPHERAL_MCM))
        cortex_m4_set_exception_vector(device->cpu, kinetis_internal_exception_vector, device);
    CortexM4Architecture architecture = profile->cpu.architecture == KINETIS_CPU_ARCHITECTURE_ARMV6_M
                                            ? CORTEX_M4_ARCHITECTURE_ARMV6_M
                                            : CORTEX_M4_ARCHITECTURE_ARMV7E_M;
    if (!cortex_m4_configure_architecture(device->cpu, architecture)) {
        destroy_partial_device(device);
        return NULL;
    }
    if (!cortex_m4_configure_implementation(device->cpu, profile->cpu.external_irq_count,
                                            profile->cpu.nvic_priority_bits,
                                            profile->cpu.has_mpu ? 8u : 0u)) {
        destroy_partial_device(device);
        return NULL;
    }
    cortex_m4_set_core_revision(device->cpu, profile->cpu.core_revision_major,
                                profile->cpu.core_revision_minor);
    return device;
}

void kinetis_destroy(Kinetis* device) { destroy_partial_device(device); }

CortexM4* kinetis_cpu(Kinetis* device) { return device == NULL ? NULL : device->cpu; }

const CortexM4* kinetis_cpu_const(const Kinetis* device) {
    return device == NULL ? NULL : device->cpu;
}

static void sync_flash_configuration(Kinetis* device) {
    KinetisPeripheralBlock block;
    if (!kinetis_profile_peripheral_block(device->profile, KINETIS_PERIPHERAL_FLASH_CONFIG,
                                          &block) ||
        block.address + block.size > device->configuration.flash_size) {
        return;
    }
    (void)kinetis_data_set_flash_configuration(device->data, device->flash + block.address,
                                               block.size);
    memcpy(device->io.configuration.flash_configuration, device->flash + block.address, block.size);
}

