tylertms/kinetis-k22-sim/src/device/kinetis/device.c
static void clear_sram_range(Kinetis* device, size_t offset, size_t size) {
    memset(device->sram + offset, 0, size);
    memset(device->sram_initialized + offset, 0, size);
}

static void apply_vlls_sram_retention(Kinetis* device) {
    if (kinetis_timing_power_status(&device->timing) != 0x40u)
        return;

    uint32_t retained_size;
    switch (device->timing.smc[2] & 7u) {
    case 0u:
    case 1u:
        retained_size = 0u;
        break;
    case 2u:
        retained_size = (device->timing.smc[2] & 0x10u) != 0u
                            ? device->profile->vlls2_sram_upper_size_with_ram2
                            : device->profile->vlls2_sram_upper_size;
        break;
    case 3u:
        return;
    default:
        return;
    }

    const uint64_t device_begin = device->sram_base;
    const uint64_t device_end = device_begin + device->configuration.sram_size;
    const uint64_t retained_begin = device->profile->sram_upper_address;
    const uint64_t retained_end = retained_begin + retained_size;
    const uint64_t overlap_begin = device_begin > retained_begin ? device_begin : retained_begin;
    const uint64_t overlap_end = device_end < retained_end ? device_end : retained_end;
    if (overlap_begin >= overlap_end) {
        clear_sram_range(device, 0u, device->configuration.sram_size);
        return;
    }

    const size_t prefix_size = (size_t)(overlap_begin - device_begin);
    const size_t suffix_offset = (size_t)(overlap_end - device_begin);
    clear_sram_range(device, 0u, prefix_size);
    clear_sram_range(device, suffix_offset, device->configuration.sram_size - suffix_offset);
}

static bool save_register_file(const Kinetis* device, KinetisPeripheralId id,
                               uint8_t register_file[0x20]) {
    KinetisPeripheralBlock block;
    if (!kinetis_profile_peripheral_block(device->profile, id, &block) || block.size != 0x20u)
        return false;
    memcpy(register_file, device->peripheral + block.address - KINETIS_PERIPHERAL_BASE, block.size);
    return true;
}

static void restore_register_file(Kinetis* device, KinetisPeripheralId id,
                                  const uint8_t register_file[0x20]) {
    KinetisPeripheralBlock block;
    if (kinetis_profile_peripheral_block(device->profile, id, &block) && block.size == 0x20u)
        memcpy(device->peripheral + block.address - KINETIS_PERIPHERAL_BASE, register_file,
               block.size);
}

bool kinetis_reset(Kinetis* device) {
    if (device == NULL) {
        return false;
    }
    memset(device->sram, 0, device->configuration.sram_size);
    memset(device->sram_initialized, 0, device->configuration.sram_size);
    device->uninitialized_sram_read_count = 0u;
    device->first_uninitialized_sram_read = UINT32_MAX;
    device->cycles = 0;
    device->timing.elapsed_core_cycles = 0;
    sync_flash_configuration(device);
    device->reset_pin_enabled = device->profile->id != KINETIS_PROFILE_MKV10Z1287 ||
                                (device->flash[0x40du] & 8u) != 0u;
    kinetis_peripheral_reset(device);
    kinetis_timing_reset(&device->timing, 0x82u, 0);
    kinetis_sync_clock_gates(device);
    const bool reset_succeeded =
        cortex_m4_reset(device->cpu, device->configuration.vector_table_address);
    fmc_clear_cache(device);
    return reset_succeeded;
}

void kinetis_warm_reset(Kinetis* device, uint8_t reset_cause_0, uint8_t reset_cause_1) {
    if (device == NULL) {
        return;
    }
    device->uninitialized_sram_read_count = 0u;
    device->first_uninitialized_sram_read = UINT32_MAX;
    apply_vlls_sram_retention(device);
    uint8_t retained_vbat[0x20];
    uint8_t retained_system_registers[0x20];
    const bool has_vbat = save_register_file(device, KINETIS_PERIPHERAL_RFVBAT, retained_vbat);
    const bool has_system_registers =
        save_register_file(device, KINETIS_PERIPHERAL_RFSYS, retained_system_registers);
    sync_flash_configuration(device);
    kinetis_peripheral_reset(device);
    if (has_vbat)
        restore_register_file(device, KINETIS_PERIPHERAL_RFVBAT, retained_vbat);
    if (has_system_registers)
        restore_register_file(device, KINETIS_PERIPHERAL_RFSYS, retained_system_registers);
    kinetis_timing_warm_reset(&device->timing, reset_cause_0, reset_cause_1);
    kinetis_sync_clock_gates(device);
    (void)cortex_m4_reset(device->cpu, device->configuration.vector_table_address);
    fmc_clear_cache(device);
}

bool kinetis_load(Kinetis* device, uint32_t address, const void* input_data, size_t data_size) {
    if (device == NULL || input_data == NULL) {
        return false;
    }
    if (address < device->configuration.flash_size &&
        (uint64_t)address + data_size <= device->configuration.flash_size) {
        memcpy(device->flash + address, input_data, data_size);
        fmc_clear_cache(device);
        sync_flash_configuration(device);
        return true;
    }
    if (address >= device->sram_base &&
        (uint64_t)address + data_size <=
            (uint64_t)device->sram_base + device->configuration.sram_size) {
        memcpy(device->sram + address - device->sram_base, input_data, data_size);
        memset(device->sram_initialized + address - device->sram_base, 1, data_size);
        return true;
    }
    return false;
}

bool kinetis_seed(Kinetis* device, uint32_t address, const void* input_data, size_t data_size) {
    return kinetis_write(device, address, input_data, data_size);
}

bool kinetis_read(const Kinetis* device, uint32_t address, void* output_data, size_t data_size) {
    if (device == NULL || output_data == NULL) {
        return false;
    }
    uint8_t* output_bytes = output_data;
    size_t byte_offset = 0u;
    while (byte_offset < data_size) {
        const size_t remaining_bytes = data_size - byte_offset;
        const uint8_t access_size = remaining_bytes >= 4 && ((address + byte_offset) & 3u) == 0 ? 4
                                    : remaining_bytes >= 2 && ((address + byte_offset) & 1u) == 0
                                        ? 2
                                        : 1;
        uint32_t transfer_value = 0u;
        if (!kinetis_read_bus((Kinetis*)device, address + (uint32_t)byte_offset, access_size,
                              CORTEX_M4_ACCESS_DEBUG, &transfer_value)) {
            return false;
        }
        write_little_endian(output_bytes + byte_offset, access_size, transfer_value);
        byte_offset += access_size;
    }
    return true;
}

bool kinetis_write(Kinetis* device, uint32_t address, const void* input_data, size_t data_size) {
    if (device == NULL || input_data == NULL) {
        return false;
    }
    const uint8_t* input_bytes = input_data;
    size_t byte_offset = 0u;
    while (byte_offset < data_size) {
        const size_t remaining_bytes = data_size - byte_offset;
        const uint8_t access_size = remaining_bytes >= 4 && ((address + byte_offset) & 3u) == 0 ? 4
                                    : remaining_bytes >= 2 && ((address + byte_offset) & 1u) == 0
                                        ? 2
                                        : 1;
        const uint32_t transfer_value = read_little_endian(input_bytes + byte_offset, access_size);
        if (!kinetis_write_bus(device, address + (uint32_t)byte_offset, access_size,
                               CORTEX_M4_ACCESS_DEBUG, transfer_value)) {
            return false;
        }
        byte_offset += access_size;
    }
    return true;
}

bool kinetis_copy(Kinetis* destination, const Kinetis* source) {
    if (destination == NULL || source == NULL || destination->profile->id != source->profile->id ||
        destination->package != source->package ||
        destination->configuration.flash_size != source->configuration.flash_size ||
        destination->configuration.sram_size != source->configuration.sram_size) {
        return false;
    }
    memcpy(destination->flash, source->flash, source->configuration.flash_size);
    memcpy(destination->sram, source->sram, source->configuration.sram_size);
    memcpy(destination->sram_initialized, source->sram_initialized,
           source->configuration.sram_size);
    memcpy(destination->peripheral, source->peripheral, KINETIS_PERIPHERAL_SIZE);
    memcpy(destination->private_peripheral, source->private_peripheral,
           KINETIS_PRIVATE_PERIPHERAL_SIZE);
    destination->configuration = source->configuration;
    destination->uninitialized_sram_read_count = source->uninitialized_sram_read_count;
    destination->first_uninitialized_sram_read = source->first_uninitialized_sram_read;
    destination->cycles = source->cycles;
    destination->reset_pin_enabled = source->reset_pin_enabled;
    destination->cmt_cycles = source->cmt_cycles;
    destination->cmt_bus_remainder = source->cmt_bus_remainder;
    destination->cmt_mark_ticks = source->cmt_mark_ticks;
    destination->cmt_period_ticks = source->cmt_period_ticks;
    destination->cmt_carrier_high_ticks = source->cmt_carrier_high_ticks;
    destination->cmt_carrier_period_ticks = source->cmt_carrier_period_ticks;
    destination->cmt_carrier_offset_ticks = source->cmt_carrier_offset_ticks;
    destination->cmt_output_delay_ticks = source->cmt_output_delay_ticks;
    destination->cmt_eoc_read = source->cmt_eoc_read;
    destination->cmt_running = source->cmt_running;
    destination->cmt_stop_pending = source->cmt_stop_pending;
    destination->cmt_fsk_secondary = source->cmt_fsk_secondary;
    destination->cmt_extended_space = source->cmt_extended_space;
    destination->cmt_dma_pending = source->cmt_dma_pending;
    memcpy(destination->fmc_bank, source->fmc_bank, sizeof(destination->fmc_bank));
    memcpy(destination->fmc_age, source->fmc_age, sizeof(destination->fmc_age));
    destination->fmc_access_count = source->fmc_access_count;
    destination->mmdvsq_pending_result = source->mmdvsq_pending_result;
    destination->mmdvsq_pending_control = source->mmdvsq_pending_control;
    destination->mmdvsq_cycles_remaining = source->mmdvsq_cycles_remaining;
    destination->mmdvsq_stall_cycles = source->mmdvsq_stall_cycles;
    destination->mtb_previous_address = source->mtb_previous_address;
    destination->mtb_previous_opcode = source->mtb_previous_opcode;
    destination->mtb_previous_lr = source->mtb_previous_lr;
    destination->mtb_previous_exception = source->mtb_previous_exception;
    destination->mtb_previous_valid = source->mtb_previous_valid;
    destination->mtb_first_packet = source->mtb_first_packet;
    destination->mtb_autostop_latched = source->mtb_autostop_latched;
    destination->mtb_stop_pending = source->mtb_stop_pending;
    (void)kinetis_usbdcd_copy(&destination->usbdcd, &source->usbdcd);
    memcpy(destination->comparator_output, source->comparator_output,
           sizeof(destination->comparator_output));
    memcpy(destination->data_interrupt, source->data_interrupt,
           sizeof(destination->data_interrupt));
    memcpy(destination->events, source->events, sizeof(destination->events));
    destination->event_read_index = source->event_read_index;
    destination->event_write_index = source->event_write_index;
    destination->event_count = source->event_count;
    if (!kinetis_data_copy(destination->data, source->data) ||
        !kinetis_sdhc_copy(&destination->sdhc, &source->sdhc, kinetis_sdhc_bus(destination)) ||
        !kinetis_serial_copy(&destination->serial, &source->serial) ||
        !kinetis_io_copy(&destination->io, &source->io) ||
        !kinetis_timing_copy(&destination->timing, &source->timing,
                             kinetis_timing_signals(destination))) {
        return false;
    }
    destination->io.configuration.event_handler =
        kinetis_io_configuration(destination).event_handler;
    destination->io.configuration.event_context = destination;
    if (source->flexbus_memory != NULL) {
        if (!kinetis_flexbus_attach(destination, source->flexbus_address, source->flexbus_memory,
                                    source->flexbus_size, source->flexbus_read_only))
            return false;
    } else {
        kinetis_flexbus_detach(destination);
    }
    return cortex_m4_copy(destination->cpu, source->cpu);
}

