tylertms/kinetis-k22-sim/src/device/kinetis/device.c
uint64_t kinetis_get_uninitialized_sram_read_count(const Kinetis* device) {
    return device == NULL ? 0u : device->uninitialized_sram_read_count;
}

uint32_t kinetis_get_first_uninitialized_sram_read(const Kinetis* device) {
    return device == NULL ? UINT32_MAX : device->first_uninitialized_sram_read;
}

void kinetis_clear_uninitialized_sram_reads(Kinetis* device) {
    if (device == NULL) {
        return;
    }
    device->uninitialized_sram_read_count = 0u;
    device->first_uninitialized_sram_read = UINT32_MAX;
}

static bool is_live_timing_register(uint32_t address) {
    const bool pit_state =
        address >= 0x40037104u && address <= 0x4003713cu &&
        ((address - 0x40037104u) % 0x10u == 0u || (address - 0x4003710cu) % 0x10u == 0u);
    return pit_state || address == 0x40052010u || address == 0x40052012u;
}

static bool read_comparable_register(Kinetis* device, uint32_t address, uint8_t size,
                                     uint32_t* value) {
    if (address >= 0x40052000u && address < 0x40052018u) {
        return kinetis_timing_projected_watchdog_read(&device->timing, address, size, value);
    }
    return kinetis_memory_read(device, address, size, CORTEX_M4_ACCESS_DEBUG, value);
}

bool kinetis_register_state_equal(Kinetis* first, Kinetis* second, uint32_t* first_difference,
                                  uint32_t* first_value, uint32_t* second_value) {
    if (first == NULL || second == NULL || first->profile != second->profile ||
        first_difference == NULL || first_value == NULL || second_value == NULL) {
        return false;
    }
    for (size_t index = 0u; index < first->manifest->register_count; ++index) {
        const KinetisRegisterDescriptor* descriptor = &first->manifest->registers[index];
        const bool fmc_cache_state = descriptor->address >= KINETIS_FMC + 0x100u &&
                                     descriptor->address < KINETIS_FMC + 0x300u;
        const bool dma_address = descriptor->address >= 0x40009000u &&
                                 descriptor->address < 0x40009200u &&
                                 ((descriptor->address - 0x40009000u) % 32u == 0u ||
                                  (descriptor->address - 0x40009000u) % 32u == 16u);
        if (fmc_cache_state || dma_address || is_live_timing_register(descriptor->address)) {
            continue;
        }
        const uint32_t mask = descriptor->implemented_mask & descriptor->read_mask;
        if ((descriptor->access & KINETIS_REGISTER_ACCESS_READ) == 0u || mask == 0u) {
            continue;
        }
        const uint8_t size = (uint8_t)(descriptor->width / 8u);
        uint32_t first_register = 0u;
        uint32_t second_register = 0u;
        const bool first_read =
            read_comparable_register(first, descriptor->address, size, &first_register);
        const bool second_read =
            read_comparable_register(second, descriptor->address, size, &second_register);
        if (first_read != second_read ||
            (first_read && (first_register & mask) != (second_register & mask))) {
            *first_difference = descriptor->address;
            *first_value = first_register & mask;
            *second_value = second_register & mask;
            return false;
        }
    }
    return true;
}

bool kinetis_flexbus_attach(Kinetis* device, uint32_t address, const void* input_data,
                            size_t window_size, bool read_only) {
    if (device == NULL || input_data == NULL || window_size == 0u ||
        (uint64_t)address + window_size > UINT64_C(0x100000000) ||
        !kinetis_package_has_peripheral(device->package, KINETIS_PERIPHERAL_FB))
        return false;
    uint8_t* window_memory = malloc(window_size);
    if (window_memory == NULL)
        return false;
    memcpy(window_memory, input_data, window_size);
    free(device->flexbus_memory);
    device->flexbus_memory = window_memory;
    device->flexbus_address = address;
    device->flexbus_size = window_size;
    device->flexbus_read_only = read_only;
    return true;
}

void kinetis_flexbus_detach(Kinetis* device) {
    if (device == NULL)
        return;
    free(device->flexbus_memory);
    device->flexbus_memory = NULL;
    device->flexbus_address = 0u;
    device->flexbus_size = 0u;
    device->flexbus_read_only = false;
}

bool kinetis_flexbus_read(const Kinetis* device, size_t window_offset, void* output_data,
                          size_t read_size) {
    if (device == NULL || output_data == NULL || device->flexbus_memory == NULL ||
        window_offset > device->flexbus_size || read_size > device->flexbus_size - window_offset)
        return false;
    memcpy(output_data, device->flexbus_memory + window_offset, read_size);
    return true;
}

void kinetis_advance(Kinetis* device, uint32_t cycle_count) {
    if (device != NULL && cycle_count != 0u) {
        kinetis_advance_bus(device, cycle_count);
    }
}

void kinetis_watchdog_advance(Kinetis* device, uint32_t ticks) {
    if (device != NULL)
        kinetis_timing_watchdog_advance(&device->timing, ticks);
}

uint32_t kinetis_core_clock_hz(const Kinetis* device) {
    return device == NULL ? 0 : kinetis_timing_core_clock_hz(&device->timing);
}

uint32_t kinetis_bus_clock_hz(const Kinetis* device) {
    return device == NULL ? 0 : kinetis_timing_bus_clock_hz(&device->timing);
}
